In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df1=pd.DataFrame(np.arange(9).reshape(3,3),index=['2000','2001','2002'],columns=['Ohio','California','America'])

In [4]:
df2=pd.DataFrame(np.arange(12).reshape(3,4),index=['2000','2001','2002'],columns=['Ohio','California','America','India'])

In [5]:
df1

      Ohio  California  America
2000     0           1        2
2001     3           4        5
2002     6           7        8

In [6]:
df2

      Ohio  California  America  India
2000     0           1        2      3
2001     4           5        6      7
2002     8           9       10     11

In [7]:
df1+df2

      America  California  India  Ohio
2000        4           2    NaN     0
2001       11           9    NaN     7
2002       18          16    NaN    14

In [8]:
df1.add(df2,fill_value=0)           #fill value allows to fill value into NaN into df1 before adding both

      America  California  India  Ohio
2000        4           2    3.0     0
2001       11           9    7.0     7
2002       18          16   11.0    14

In [10]:
#Other functions for arithmetic operations are also present
#Look pg. no:149

*A.O B/w df and series:*

In [13]:
series1=df1.iloc[0]

In [14]:
series1

Ohio          0
California    1
America       2
Name: 2000, dtype: int32

In [15]:
df1

      Ohio  California  America
2000     0           1        2
2001     3           4        5
2002     6           7        8

In [16]:
df1-series1                        #by default matching along rows so axis=1

      Ohio  California  America
2000     0           0        0
2001     3           3        3
2002     6           6        6

In [18]:
#This is termed as broadcasting over the columns, matching the rows.(cause' series was subtracted from each row of df1) 
#By default its like this.If you want to broardcast over the rows ,matching coulumns see below:

In [23]:
series2=df2.iloc[:,0]

In [24]:
series2

2000    0
2001    4
2002    8
Name: Ohio, dtype: int32

In [25]:
df2.sub(series2,axis=0)            #remember axis means matching series with given axis of main df

      Ohio  California  America  India
2000     0           1        2      3
2001     0           1        2      3
2002     0           1        2      3

In [26]:
df2

      Ohio  California  America  India
2000     0           1        2      3
2001     4           5        6      7
2002     8           9       10     11